app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `carpetas`
WHERE `user_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `archivos`
WHERE `user_id` = '1'
---
    public function index()
    {
        if ($this->session->rol == 1) {
            $data = [
                'usuarios' => $this->usuarioModel->countAllResults(),
                'carpetas' => $this->carpetaModel->where('user_id', $this->session->user_id)->countAllResults(),
                'archivos' => $this->archivoModel->where('user_id', $this->session->user_id)->countAllResults(),

SELECT SUM(IF(MONTH(created_at) = 1, 1, 0)) AS ene, SUM(IF(MONTH(created_at) = 2, 1, 0)) AS feb, SUM(IF(MONTH(created_at) = 3, 1, 0)) AS mar, SUM(IF(MONTH(created_at) = 4, 1, 0)) AS abr, SUM(IF(MONTH(created_at) = 5, 1, 0)) AS may, SUM(IF(MONTH(created_at) = 6, 1, 0)) AS jun, SUM(IF(MONTH(created_at) = 7, 1, 0)) AS jul, SUM(IF(MONTH(created_at) = 8, 1, 0)) AS ago, SUM(IF(MONTH(created_at) = 9, 1, 0)) AS sep, SUM(IF(MONTH(created_at) = 10, 1, 0)) AS oct, SUM(IF(MONTH(created_at) = 11, 1, 0)) AS nov, SUM(IF(MONTH(created_at) = 12, 1, 0)) AS dic
FROM `usuarios`
 LIMIT 1
---
    public function usuario() {

        $data = $this->usuarioModel->select("
        SUM(IF(MONTH(created_at) = 1, 1, 0)) AS ene,
        SUM(IF(MONTH(created_at) = 2, 1, 0)) AS feb,
        SUM(IF(MONTH(created_at) = 3, 1, 0)) AS mar,
        SUM(IF(MONTH(created_at) = 4, 1, 0)) AS abr,
        SUM(IF(MONTH(created_at) = 5, 1, 0)) AS may,
        SUM(IF(MONTH(created_at) = 6, 1, 0)) AS jun,
        SUM(IF(MONTH(created_at) = 7, 1, 0)) AS jul,
        SUM(IF(MONTH(created_at) = 8, 1, 0)) AS ago,
        SUM(IF(MONTH(created_at) = 9, 1, 0)) AS sep,
        SUM(IF(MONTH(created_at) = 10, 1, 0)) AS oct,
        SUM(IF(MONTH(created_at) = 11, 1, 0)) AS nov,
        SUM(IF(MONTH(created_at) = 12, 1, 0)) AS dic")->first();

SELECT `nombre`, `apellido`
FROM `usuarios`
ORDER BY `user_id` DESC
 LIMIT 3
---
    public function newusuario(){
        $data = $this->usuarioModel->select('nombre, apellido')->orderBy('user_id', 'desc')
        ->limit(3)->get()->getResultArray();

SELECT `nombre`
FROM `carpetas`
ORDER BY `carpeta_id` DESC
 LIMIT 3
---
    public function newcarpeta(){

        $data = $this->carpetaModel->select('nombre')->orderBy('carpeta_id', 'desc')
        ->limit(3)->get()->getResultArray();

SELECT `nombre`
FROM `archivos`
ORDER BY `archivo_id` DESC
 LIMIT 3
---
    public function newarchivo(){

        $data = $this->archivoModel->select('nombre')->orderBy('archivo_id', 'desc')
        ->limit(3)->get()->getResultArray();