app/Controllers/ArchivoController.php

    public function show($id)
    {
        $data['archivos'] = $this->archivoModel
            ->where('carpeta_id', $id)
            ->orderBy('created_at', 'desc')
            ->findAll();
---
SELECT *
FROM `archivos`
WHERE `carpeta_id` = '6'
ORDER BY `created_at` DESC