app/Controllers/CarpetaController.php

    public function index()
    {
        $carpetas = $this->carpetaModel
            ->where([
                'user_id' => $this->session->user_id,
                'carpetapadre_id' => null
            ])->orderBy('carpeta_id', 'desc')
            ->paginate(12);

        $cantidadArchivos = $this->archivoModel->select('carpeta_id, COUNT(*) as total')
            ->where('user_id', $this->session->user_id)
            ->groupBy('carpeta_id')->get()->getResultArray();
---
SELECT *
FROM `carpetas`
WHERE `user_id` = '1'
AND `carpetapadre_id` IS NULL
ORDER BY `carpeta_id` DESC
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `carpetas`
WHERE `user_id` = '1'
AND `carpetapadre_id` IS NULL
SELECT `carpeta_id`, COUNT(*) as total
FROM `archivos`
WHERE `user_id` = '1'
GROUP BY `carpeta_id`

    public function show($id)
    {
        //COMPROBAR SI LA CARPETA ME PERTENECE
        $existe = $this->carpetaModel->find($id);
        if ($existe == null || $existe['user_id'] != $this->session->user_id) {
            return redirect()->to('carpetas')->with('respuesta', [
                'type' => 'danger',
                'msg' => 'No tienes permisos'
            ]);
        }
        $carpetas = $this->carpetaModel
            ->where('carpetapadre_id', $id)->orderBy('carpeta_id', 'desc')
            ->paginate(12);

        $cantidadArchivos = $this->archivoModel->select('carpeta_id, COUNT(*) as total')
            ->where('user_id', $this->session->user_id)
            ->groupBy('carpeta_id')->get()->getResultArray();
---
SELECT *
FROM `carpetas`
WHERE `carpetas`.`carpeta_id` = '1'
SELECT *
FROM `carpetas`
WHERE `carpetapadre_id` = '1'
ORDER BY `carpeta_id` DESC
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `carpetas`
WHERE `carpetapadre_id` = '1'
SELECT `carpeta_id`, COUNT(*) as total
FROM `archivos`
WHERE `user_id` = '1'
GROUP BY `carpeta_id`