app/Controllers/CompartidoController.php

    public function carpeta()
    {
        $carpetas = $this->carpetaModel->select('carpcompartidas.*, c.nombre')
        ->join('carpetas AS c', 'carpcompartidas.carpeta_id = c.carpeta_id')
        ->where('carpcompartidas.user_id', $this->session->user_id)
        ->orderBy('carpcompartidas.id', 'desc')
        ->paginate(12);

        $cantidadArchivos = $this->archivoModel->select('carpeta_id, COUNT(*) as total')
        ->groupBy('carpeta_id')->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `carpcompartidas`
JOIN `carpetas` AS `c` ON `carpcompartidas`.`carpeta_id` = `c`.`carpeta_id`
WHERE `carpcompartidas`.`user_id` = '1'
SELECT `carpcompartidas`.*, `c`.`nombre`
FROM `carpcompartidas`
JOIN `carpetas` AS `c` ON `carpcompartidas`.`carpeta_id` = `c`.`carpeta_id`
WHERE `carpcompartidas`.`user_id` = '1'
ORDER BY `carpcompartidas`.`id` DESC
 LIMIT 12
SELECT `carpeta_id`, COUNT(*) as total
FROM `archivos`
GROUP BY `carpeta_id`