app/Controllers/PerfilController.php

    public function index()
    {
        $data['usuario'] = $this->usuarioModel->find($this->session->user_id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`user_id` = '1'